---
kind: property
id: P:Autodesk.Revit.DB.Fabrication.FabricationPartSizeMap.Depth
source: html/db072586-a1ec-bca2-c393-b29bf7c02606.htm
---
# Autodesk.Revit.DB.Fabrication.FabricationPartSizeMap.Depth Property

The depth of the straight.

## Syntax (C#)
```csharp
public double Depth { get; set; }
```